---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookOrientBottomDirn1
source: html/0fde9472-8cba-1915-3a9c-b6d38708b904.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookOrientBottomDirn1 Property

"Bottom Major Hook Orientation"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemHookOrientBottomDirn1 { get; }
```